# =============================================================================
# HOMEBREW BREWFILE - macOS Apple Silicon (arm64)
# =============================================================================
# Architecture: Apple Silicon (M1/M2/M3/M4 Pro)
# Last updated: 2026-02

# =============================================================================
# TAPS
# =============================================================================
tap "hashicorp/tap"                 # Terraform
tap "oven-sh/bun"                   # Bun runtime
tap "sst/tap"                       # SST framework
tap "tw93/tap"                      # Mole terminal file manager

# =============================================================================
# CLI TOOLS - ESSENTIAL
# =============================================================================
brew "bash"                         # Latest Bash shell
brew "biome"                        # Fast linter and formatter (JS/TS)
brew "direnv"                       # Project environment switcher
brew "fnm"                          # Fast Node.js version manager
brew "gh"                           # GitHub CLI
brew "git-filter-repo"              # Git history rewriting
brew "pandoc"                       # Document converter
brew "watch"                        # Execute commands periodically

# =============================================================================
# CLI TOOLS - PYTHON
# =============================================================================
brew "python@3.13"                  # Python runtime
brew "python@3.14"                  # Python runtime (latest)
brew "pipx"                         # Install Python CLI apps
brew "uv"                           # Fast Python package installer (rust)

# =============================================================================
# CLI TOOLS - JAVASCRIPT
# =============================================================================
brew "oven-sh/bun/bun"              # Fast JavaScript runtime

# =============================================================================
# CLI TOOLS - INFRASTRUCTURE
# =============================================================================
brew "hashicorp/tap/terraform"      # Infrastructure as Code
brew "pulumi"                       # Infrastructure as Code (alternative)

# =============================================================================
# CLI TOOLS - KUBERNETES & CONTAINERS
# =============================================================================
brew "docker"                       # Container runtime
brew "docker-buildx"                # Docker build extensions
brew "helm"                         # Kubernetes package manager
brew "kubernetes-cli"               # kubectl

# =============================================================================
# CLI TOOLS - MEDIA
# =============================================================================
brew "ffmpeg"                       # Video/audio processing
brew "openai-whisper"               # Speech-to-text

# =============================================================================
# CLI TOOLS - UTILITIES
# =============================================================================
brew "cloudflared"                  # Cloudflare tunnel client
brew "ngrok"                        # Expose local servers to internet
brew "tw93/tap/mole"                # Terminal file manager

# =============================================================================
# CLI TOOLS - AI / DEVELOPMENT TOOLS
# =============================================================================
brew "codex"                        # OpenAI Codex CLI
brew "powerlevel10k"                # ZSH theme (via Homebrew)

# =============================================================================
# CASK APPLICATIONS - ESSENTIAL
# =============================================================================
cask "1password-cli"                # 1Password CLI (op command)
cask "ghostty"                      # Modern terminal emulator
cask "font-hack-nerd-font"          # Nerd Font for terminal

# =============================================================================
# CASK APPLICATIONS - PRODUCTIVITY
# =============================================================================
cask "alt-tab"                      # Windows-like alt-tab
cask "hiddenbar"                    # Menu bar icon manager
cask "stats"                        # System monitor in menu bar

# =============================================================================
# CASK APPLICATIONS - DEVELOPMENT (Optional)
# =============================================================================
# cask "cursor"                     # AI-first code editor
# cask "sublime-text"               # Fast text editor
# cask "iterm2"                     # Terminal alternative
# cask "github"                     # GitHub Desktop
# cask "warp"                       # AI-powered terminal

# =============================================================================
# CASK APPLICATIONS - UTILITIES (Optional)
# =============================================================================
# cask "vlc"                        # Media player
# cask "ngrok"                      # Expose local servers

# =============================================================================
# AWS TOOLS
# =============================================================================
cask "session-manager-plugin"       # AWS Session Manager
