# Taps
tap "hashicorp/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "tw93/tap"

# CLI tools
brew "biome"                        # Fast linter and formatter
brew "codex"                        # OpenAI Codex CLI
brew "docker"                       # Container runtime
brew "docker-buildx"                # Docker build extensions
brew "ffmpeg"                       # Video/audio processing
brew "gh"                           # GitHub CLI
brew "git-filter-repo"              # Git history rewriting
brew "helm"                         # Kubernetes package manager
brew "kubernetes-cli"               # kubectl
brew "pandoc"                       # Document converter
brew "python@3.13"                  # Python runtime
brew "uv"                           # Fast Python package installer
brew "watch"                        # Execute commands periodically
brew "whisper-cpp"                  # OpenAI Whisper C++ port
brew "hashicorp/tap/terraform"      # Infrastructure as Code
brew "oven-sh/bun/bun"              # Fast JavaScript runtime
brew "tw93/tap/mole"                # Terminal file manager

# Cask applications
cask "1password-cli"                # 1Password CLI
cask "alt-tab"                      # Windows-like alt-tab
cask "font-hack-nerd-font"          # Nerd Font for terminal
cask "ghostty"                      # Modern terminal emulator
cask "hiddenbar"                    # Menu bar icon manager
cask "numi"                         # Calculator app
cask "session-manager-plugin"       # AWS Session Manager

# Optional: VSCode extensions (uncomment if you want to manage via Brewfile)
# vscode "4ops.terraform"
# vscode "anthropic.claude-code"
# vscode "biomejs.biome"
# vscode "bradlc.vscode-tailwindcss"
# vscode "burkeholland.simple-react-snippets"
# vscode "christian-kohler.npm-intellisense"
# vscode "davidanson.vscode-markdownlint"
# vscode "dracula-theme-pro.theme-dracula-pro"
# vscode "dsznajder.es7-react-js-snippets"
# vscode "github.vscode-github-actions"
# vscode "hashicorp.terraform"
# vscode "mechatroner.rainbow-csv"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "pkief.material-icon-theme"
