4ops.terraform
anthropic.claude-code
biomejs.biome
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
christian-kohler.npm-intellisense
coderabbit.coderabbit-vscode
davidanson.vscode-markdownlint
dracula-theme-pro.theme-dracula-pro
dsznajder.es7-react-js-snippets
github.vscode-github-actions
hashicorp.terraform
kilocode.kilo-code
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
pkief.material-icon-theme
rodrigovallades.es7-react-js-snippets
sourcegraph.amp
sst-dev.opencode
uctakeoff.vscode-counter
